# -*- coding:utf-8 -*-
# @Time    : 2022/6/17 15:01
# @File    : network_basics.py
# Author: lee



"""
1.python的底层网络交互模块有哪些


"""






"""
2.简述OSI七层协议

"""



"""
3.什么是C/S和B/S架构

"""



"""
4.简述TCP三次握手，四次挥手的流程。
"""



"""
5.如果已经建立了TCP连接，
但是客户端突然出现故障了怎么办
"""




"""
6.什么是arp协议
"""








"""
7.TCP和UDP的区别
"""








"""
8.为什么基于tcp协议的通信比基于udp协议的通信更可靠
"""








"""
9.什么是局域网和广域网
"""







"""
10.什么是socket？简述基于tcp协议的socket通信流程？
"""





"""
11.什么是粘包？出现粘包的原因？
"""










"""
12.发生粘包现象如何处理？
"""







"""
# 这个不会的
13.IO多路复用的作用？

select、poll、epoll模型的区别
"""




"""
14.什么是防火墙？防火墙的作用是什么？
"""





"""

"""




"""

"""






"""

"""









"""

"""








"""

"""






"""

"""







"""

"""








"""

"""








"""

"""






"""

"""
